const TREE_NODES = [
  // ================= ПЛУТ =================
  { id: 'rogue', name: 'Плут', type: 'class', parent: null, cost: '0', multi: '4', x: 200, y: 100 },
  
  { id: 'adv', name: 'Авантюрист', type: 'subclass', parent: 'rogue', cost: '0', multi: '4', x: 50, y: 300 },
  { id: 'p1', name: 'А. "Зажигалка"', type: 'skill', parent: 'adv', cost: '0', multi: '4', x: -100, y: 500, desc: 'Создает область света на 1 ход.' },
  { id: 'p2', name: 'П. "Щепетильность"', type: 'skill', parent: 'adv', cost: '0', multi: '4', x: 100, y: 500, desc: 'доп 1/10 от итогового распределения лута если это деньги' },
  
  { id: 'seeker', name: 'Искатель', type: 'subclass', parent: 'adv', cost: '3', multi: '4', x: -150, y: 700 },
  { id: 'p7', name: 'А. "Улики"', type: 'skill', parent: 'seeker', cost: '3', multi: '4', x: -200, y: 900, desc: 'Искатель узнает еще один факт/предмет/персонажа/место, связанное с его темой сл 12/14/16/18 в зависимости от притязаний по порядку. В случае провала получает вполовину выпавшего значения как психический урон.' },
  { id: 'p8', name: 'А. "Нюх"', type: 'skill', parent: 'seeker', cost: '3', multi: '4', x: -100, y: 900, desc: 'Искатель опознает самый дорогой предмет в комнате сл 10 проворство/эрудиция. При провале предмет испорчен.' },
  
  { id: 'treasure', name: 'Охотник за сокровищами', type: 'skill', parent: 'seeker', cost: '3', multi: '4', x: -250, y: 1100 },
  { id: 'p15', name: 'А. "Давно в деле"', type: 'skill', parent: 'treasure', cost: '3', multi: '4', x: -300, y: 1300, desc: 'Охотник за сокровищами продает предметы из данжей на 25% дороже, а покупает снаряжение для авантюристов и припасы на 25% дешевле.' },
  { id: 'p16', name: 'А. "Ложись"', type: 'skill', parent: 'treasure', cost: '3', multi: '4', x: -200, y: 1300, desc: 'Когда персонаж попадает в ловушку он может упасть плашмя чтобы избежать урона' },
  
  { id: 'scoundrel', name: 'Забияка', type: 'skill', parent: 'adv', cost: '3', multi: '4', x: 0, y: 700 },
  { id: 'p17', name: 'А. "Захват"', type: 'skill', parent: 'scoundrel', cost: '3', multi: '4', x: -50, y: 900, desc: 'Противник проходит проверку атлетики 16, если ему это не удалось - он находится в захвате у забияки. Оба получают состояние лежит плашмя пока забияка не выпустит жертву.' },
  { id: 'p18', name: 'П. "По морде"', type: 'skill', parent: 'scoundrel', cost: '3', multi: '4', x: 50, y: 900, desc: 'В драке без оружия все броски совершаются с преимуществом' },

  { id: 'assassin', name: 'Ассасин', type: 'subclass', parent: 'rogue', cost: '0', multi: '4', x: 350, y: 300 },
  { id: 'p5', name: 'А. "Холодный укол"', type: 'skill', parent: 'assassin', cost: '0', multi: '4', x: 300, y: 500, desc: 'Атака 5 урона. Паралич 2 хода.' },
  { id: 'p6', name: 'П. "Вторая атака"', type: 'skill', parent: 'assassin', cost: '0', multi: '4', x: 400, y: 500, desc: 'Позволяет атаковать второй рукой бонусным действием, если второе оружие не больше первого. Половина урона.' },
  
  { id: 'shadow', name: 'Теневой клинок', type: 'skill', parent: 'assassin', cost: '3', multi: '4', x: 350, y: 700 },
  { id: 'p11', name: 'А. "Исчезновение"', type: 'skill', parent: 'shadow', cost: '3', multi: '4', x: 300, y: 900, desc: 'Сл 14 бросок проворства после успешной атаки. При успехе - персонаж незаметно спрятался в ближайшем укрытии.' },
  { id: 'p12', name: 'П. "Холодный расчет"', type: 'skill', parent: 'shadow', cost: '3', multi: '4', x: 400, y: 900, desc: 'Критические атаки холодным оружием наносят доп 1д4 урона' },
  
  { id: 'poisoner', name: 'Отравитель', type: 'skill', parent: 'assassin', cost: '3', multi: '4', x: 550, y: 700 },
  { id: 'p13', name: 'А. "Ядовитый клинок"', type: 'skill', parent: 'poisoner', cost: '3', multi: '4', x: 500, y: 900, desc: '1д8 урона, спас 14 или отравление 4 хода' },
  { id: 'p14', name: 'П. "Жало"', type: 'skill', parent: 'poisoner', cost: '3', multi: '4', x: 600, y: 900, desc: 'Дальнобойные атаки наносят доп 2 урона ядом, отравление 2 хода' },
  
  { id: 'neg', name: 'Переговорщик', type: 'subclass', parent: 'rogue', cost: '0', multi: '4', x: 650, y: 300 },
  { id: 'p19', name: 'А. "У всего есть цена"', type: 'skill', parent: 'neg', cost: '0', multi: '4', x: 600, y: 500, desc: 'Переговорщик может моментально дать взятку золотом. Если НПС не является чиновником/стражником 1д20. Если является 3д20. Нужно иметь 20/60 золотых монет.' },
  { id: 'p20', name: 'П. "Пафицист"', type: 'skill', parent: 'neg', cost: '0', multi: '4', x: 700, y: 500, desc: 'Переговорщик получает вдохновение за каждого врага, которого выведет из строя. Если при этом он или его союзник добьет противника, - переговорщик получает 1д12 психического урона.' },
  
  { id: 'spec', name: 'Спекулянт', type: 'skill', parent: 'neg', cost: '3', multi: '4', x: 650, y: 700 },
  { id: 'p21', name: 'П. "Паутина гильдии"', type: 'skill', parent: 'spec', cost: '3', multi: '4', x: 600, y: 900, desc: 'Плут может сбывать краденое и запрещенные товары обычным торговцам по минимальной цене. У некоторых торговцев для плута найдется что-то особенное.' },
  { id: 'p22', name: 'А. "Глаз наметан"', type: 'skill', parent: 'spec', cost: '3', multi: '4', x: 700, y: 900, desc: 'Позволяет прикинуть стоимость предмета +-10% по меркам этого государства либо торговцев скипеки' },
  
  { id: 'head', name: 'Охотник за головами', type: 'skill', parent: 'neg', cost: '3', multi: '4', x: 850, y: 700 },
  { id: 'p23', name: 'П. "Стремительный"', type: 'skill', parent: 'head', cost: '3', multi: '4', x: 800, y: 900, desc: 'Два действия в ход доступны' },
  { id: 'p24', name: 'А. "Противоречие"', type: 'skill', parent: 'head', cost: '3', multi: '4', x: 900, y: 900, desc: 'Когда противник проводит дальнобойную атаку. Мгновенная ответная атака Точность. Противник должен превзойти этот бросок своим Рефлексы чтобы не получить 1д4 урона.' },
  
  { id: 'mid', name: 'Полуночник', type: 'skill', parent: 'neg', cost: '3', multi: '4', x: 1050, y: 700 },
  { id: 'p25', name: 'А. "Приметы"', type: 'skill', parent: 'mid', cost: '3', multi: '4', x: 1000, y: 900, desc: 'Накладывает на противника метку. Любые попытки спрятаться или уйти в невидимость будут проводиться с помехой 4х.' },
  { id: 'p26', name: 'П. "В потемках"', type: 'skill', parent: 'mid', cost: '3', multi: '4', x: 1100, y: 900, desc: 'Невозможно застать врасплох ночью.' },
  
  { id: 'tox', name: 'Токсиколог', type: 'skill', parent: 'neg', cost: '3', multi: '4', x: 1250, y: 700 },
  { id: 'p27', name: 'А. "Едкая смесь"', type: 'skill', parent: 'tox', cost: '3', multi: '4', x: 1200, y: 900, desc: 'Если на оружие нанесен яд, этот прием нанесет доп 2д4 урона кислотой.' },
  { id: 'p28', name: 'П. "Не берет"', type: 'skill', parent: 'tox', cost: '3', multi: '4', x: 1300, y: 900, desc: 'Устойчивость к урону ядом' },
  
  { id: 'perf', name: 'Парфюмер', type: 'skill', parent: 'neg', cost: '3', multi: '4', x: 1450, y: 700 },
  { id: 'p29', name: 'А. "Аромат"', type: 'skill', parent: 'perf', cost: '3', multi: '4', x: 1400, y: 900, desc: 'Способность позволяет запечатлеть запах чего-либо в растворе масла/спирта.' },
  { id: 'p30', name: 'А. "Нотки"', type: 'skill', parent: 'perf', cost: '3', multi: '4', x: 1500, y: 900, desc: 'Плут может распознать запахи на предмете и сопоставить их с другими предметами/запахами.' },

  // ================= ЖРЕЦ =================
  { id: 'priest', name: 'Жрец', type: 'class', parent: null, cost: '0', multi: '4', x: 2200, y: 100 },
  
  { id: 'healer', name: 'Целитель', type: 'subclass', parent: 'priest', cost: '0', multi: '4', x: 2000, y: 300 },
  { id: 'j1', name: 'А. "Область исцеления"', type: 'skill', parent: 'healer', cost: '0', multi: '4', x: 1900, y: 500, desc: 'от 1 до 4х целей восстанавливают 1д4 здоровья. 1 круг' },
  { id: 'j2', name: 'П. "Ячейка 1ур"', type: 'skill', parent: 'healer', cost: '0', multi: '4', x: 2100, y: 500, desc: 'Дает ячейку 1 уровня.' },
  
  { id: 'abbot', name: 'Настоятель', type: 'subclass', parent: 'healer', cost: '3', multi: '4', x: 1850, y: 700 },
  { id: 'j3', name: 'А. "Призыв оружия"', type: 'skill', parent: 'abbot', cost: '3', multi: '4', x: 1800, y: 900, desc: 'Призывает оружие выбранного типа физ урона. 16 здоровья, урон 1д6. скорость 4.' },
  { id: 'j4', name: 'П. "Стеклянный сосуд"', type: 'skill', parent: 'abbot', cost: '3', multi: '4', x: 1900, y: 900, desc: 'Определение проклятий' },
  
  { id: 'doctor', name: 'Лекарь', type: 'subclass', parent: 'healer', cost: '3', multi: '4', x: 2150, y: 700 },
  { id: 'j5', name: 'А. "Очищение"', type: 'skill', parent: 'doctor', cost: '3', multi: '4', x: 2100, y: 900, desc: 'Снимает с цели все негативные эффекты урона, восстанавливает 20 здоровья. 2 круг' },
  { id: 'j6', name: 'П. "Ячейка 2ур"', type: 'skill', parent: 'doctor', cost: '3', multi: '4', x: 2200, y: 900, desc: 'Дает ячейку 2 уровня.' },

  { id: 'soul', name: 'Душегуб', type: 'subclass', parent: 'priest', cost: '0', multi: '4', x: 2400, y: 300 },
  { id: 'j7', name: 'А. "Загробный холод"', type: 'skill', parent: 'soul', cost: '0', multi: '4', x: 2300, y: 500, desc: 'Некротический урон 2д10. Спас 14 люди, 12 другие существа. 1 круг' },
  { id: 'j8', name: 'П. "Ячейка 1ур"', type: 'skill', parent: 'soul', cost: '0', multi: '4', x: 2500, y: 500, desc: 'Дает ячейку 1 уровня.' },

  { id: 'sect', name: 'Сектант', type: 'subclass', parent: 'soul', cost: '3', multi: '4', x: 2250, y: 700 },
  { id: 'j9', name: 'А. "Мертвая аура"', type: 'skill', parent: 'sect', cost: '3', multi: '4', x: 2200, y: 900, desc: 'После получения урона в ближнем бою, противник получит 1д8 психического урона в ответ. Аура держится пока подтверждается бросками концентрации 12. Ячейка 2 круг' },
  { id: 'j10', name: 'П. "Ячейка 2ур"', type: 'skill', parent: 'sect', cost: '3', multi: '4', x: 2300, y: 900, desc: 'Дает ячейку 2 уровня.' },
  
  { id: 'imit', name: 'Подражатель', type: 'subclass', parent: 'soul', cost: '3', multi: '4', x: 2550, y: 700 },
  { id: 'j11', name: 'А. "Контрзаклинание"', type: 'skill', parent: 'imit', cost: '3', multi: '4', x: 2500, y: 900, desc: 'Либо не дает применить противнику заклинание сл 14, либо сбивает концентрацию сл 12, либо копирует его заклинание в следующем ходу - сл 16 концентрация.' },
  { id: 'j12', name: 'П. "Тяга"', type: 'skill', parent: 'imit', cost: '3', multi: '4', x: 2600, y: 900, desc: 'Если кто-то из противников использует заклинание восстановления, ты восстанавливаешь 1д4 здоровья' },

  // 4 РЯД ЖРЕЦА
  { id: 'listener', name: 'Внемлющий', type: 'skill', parent: 'abbot', cost: '4', multi: '5', x: 1750, y: 1100 },
  { id: 'j13', name: 'А. "Молитва"', type: 'skill', parent: 'listener', cost: '4', multi: '5', x: 1700, y: 1300, desc: 'Дает доп 1д4 при следующей проверке себе или союзнику. 5 мин' },
  { id: 'j14', name: 'А. "Мученик"', type: 'skill', parent: 'listener', cost: '4', multi: '5', x: 1800, y: 1300, desc: 'Внемлющий теряет всю защиту (равна 0) и бонусное действие на 4 хода. На это же время от 1-6 целей получают 8 временных хп и +2 к защите' },

  { id: 'templar', name: 'Храмовник', type: 'skill', parent: 'abbot', cost: '4', multi: '5', x: 1950, y: 1100 },
  { id: 'j15', name: 'А. "Отпущение"', type: 'skill', parent: 'templar', cost: '4', multi: '5', x: 1900, y: 1300, desc: 'Противник восстанавливает д20хп, но следующие 4 хода наносит только половину урона. ячейка 2 круг' },
  { id: 'j16', name: 'П. "Святыня"', type: 'skill', parent: 'templar', cost: '4', multi: '5', x: 2000, y: 1300, desc: 'Алтари дают вдохновение' },

  { id: 'exorcist', name: 'Экзорцист', type: 'skill', parent: 'doctor', cost: '4', multi: '5', x: 2150, y: 1100 },
  { id: 'j17', name: 'А. "Священный бич"', type: 'skill', parent: 'exorcist', cost: '4', multi: '5', x: 2100, y: 1300, desc: 'Наносит 3д6 урона светом. Нежить и мгла получает двойной урон. 1д4 хода способности нежити или мглы заблокированы. Ячейка 2 круг' },
  { id: 'j18', name: 'А. "Изгнание"', type: 'skill', parent: 'exorcist', cost: '4', multi: '5', x: 2200, y: 1300, desc: 'Изгоняет призванное магическое существо противника, экзорцист получает д20 энергетического урона' },

  { id: 'medic', name: 'Врач', type: 'skill', parent: 'doctor', cost: '4', multi: '5', x: 2350, y: 1100 },
  { id: 'j19', name: 'А. "Плоть и духовность"', type: 'skill', parent: 'medic', cost: '4', multi: '5', x: 2300, y: 1300, desc: 'Восстанавливает цели 2д8 хп. Компонентное заклинание (любой предмет с магической энергией)' },
  { id: 'j20', name: 'П. "Ячейка 3ур"', type: 'skill', parent: 'medic', cost: '4', multi: '5', x: 2400, y: 1300, desc: 'Дает ячейку 3 уровня.' },

  { id: 'cultist', name: 'Культист', type: 'skill', parent: 'sect', cost: '4', multi: '5', x: 2200, y: 1100 },
  { id: 'j21', name: 'А. "Черные путы"', type: 'skill', parent: 'cultist', cost: '4', multi: '5', x: 2150, y: 1300, desc: 'Трудная местность в области 8 ходов. каждый ход противник проходит проверку атлетики 12, (14 людям) либо становится обездвиженным и получает 1д4 некро урона. 3 круг' },
  { id: 'j22', name: 'П. "Ячейка 3 ур"', type: 'skill', parent: 'cultist', cost: '4', multi: '5', x: 2250, y: 1300, desc: 'Дает ячейку 3 уровня.' },

  { id: 'idol', name: 'Идолопоклонник', type: 'skill', parent: 'sect', cost: '4', multi: '5', x: 2400, y: 1100 },
  { id: 'j23', name: 'А. "Сглаз"', type: 'skill', parent: 'idol', cost: '4', multi: '5', x: 2350, y: 1300, desc: 'Сглаз на цель 4 хода. Цель совершает атаки с помехой.' },
  { id: 'j24', name: 'А. "Тотем"', type: 'skill', parent: 'idol', cost: '4', multi: '5', x: 2450, y: 1300, desc: 'Создает область вокруг тотема. Каждых ход вытягивает 1 здоровья от каждого существа. Когда наберется 20 - образуется существо мглы. 3 круг' },

  { id: 'necro', name: 'Некромант', type: 'skill', parent: 'imit', cost: '4', multi: '5', x: 2550, y: 1100 },
  { id: 'j25', name: 'А. "Призыв скелета"', type: 'skill', parent: 'necro', cost: '4', multi: '5', x: 2500, y: 1300, desc: 'Призывает скелета (лучник или мечник). 25хп, атака 1д12. Скелеты рассыпаются в прах если владелец без сознания сл 10 концентрация.' },
  { id: 'j26', name: 'А. "Зомби"', type: 'skill', parent: 'necro', cost: '4', multi: '5', x: 2600, y: 1300, desc: 'Поднимает труп, обращая в союзника. Его модификаторы -1, он не способен говорить. Он будет атаковать всех кроме союзников. Ячейка 3 круг' },

  { id: 'warlock', name: 'Колдун', type: 'skill', parent: 'imit', cost: '4', multi: '5', x: 2750, y: 1100 },
  { id: 'j27', name: 'А. "Мучительные раны"', type: 'skill', parent: 'warlock', cost: '4', multi: '5', x: 2700, y: 1300, desc: 'Концентрирует на цель проклятие - 1д4 урона в ход. Каждый раз добавляет еще 1д4. Следующая атака нанесет 1д8. Проверки концентрации сл 12' },
  { id: 'j28', name: 'П. "Мнимая кровь"', type: 'skill', parent: 'warlock', cost: '4', multi: '5', x: 2800, y: 1300, desc: 'Колдун может использовать заклинания, требующие ячейку, тратя вместо нее свои хп или союзника. Хп = уровень ячейки х 10.' },

  // ================= ДРУИД =================
  { id: 'druid', name: 'Друид', type: 'class', parent: null, cost: '0', multi: '4', x: 3200, y: 100 },
  
  { id: 'keeper', name: 'Хранитель', type: 'subclass', parent: 'druid', cost: '0', multi: '4', x: 3000, y: 300 },
  { id: 'd1', name: 'А. "Разговор с животными"', type: 'skill', parent: 'keeper', cost: '0', multi: '4', x: 2900, y: 500, desc: 'Общение с животным 5 минут 1 круг' },
  { id: 'd2', name: 'П. "Ячейка 1ур"', type: 'skill', parent: 'keeper', cost: '0', multi: '4', x: 3100, y: 500, desc: 'Дает ячейку 1 уровня.' },

  { id: 'guard', name: 'Страж', type: 'skill', parent: 'keeper', cost: '3', multi: '4', x: 2850, y: 700 },
  { id: 'd3', name: 'А. "Гадюка"', type: 'skill', parent: 'guard', cost: '3', multi: '4', x: 2800, y: 900, desc: 'Урон ялом 2д6, спас 10 - отравление 3 хода. 1 круг.' },
  { id: 'd4', name: 'А. "Споры"', type: 'skill', parent: 'guard', cost: '3', multi: '4', x: 2900, y: 900, desc: 'Облако спор в области - слепота, спас 14 - 3 хода' },
  
  { id: 'defender', name: 'Защитник', type: 'skill', parent: 'keeper', cost: '3', multi: '4', x: 3150, y: 700 },
  { id: 'd5', name: 'А. "Сила природы"', type: 'skill', parent: 'defender', cost: '3', multi: '4', x: 3100, y: 900, desc: 'Землетрясение в области заставляет противников пройти спас сл 14 чтобы не упасть плашмя. Каждый ход противники получают 1д4 дробящего урона. Ячейка 2 уровня' },
  { id: 'd6', name: 'А. "Живой щит"', type: 'skill', parent: 'defender', cost: '3', multi: '4', x: 3200, y: 900, desc: 'Корневой щит покрывает от 1 до 4х персонажей и поглощает весь следующий урон. Цели находятся в состоянии паралич 2 хода. Сопротивление сл 16 атлетика. Ячейка 3 ур' },

  { id: 'thorn', name: 'Твердыня', type: 'skill', parent: 'keeper', cost: '3', multi: '4', x: 3000, y: 1100 },
  { id: 'd7', name: 'А. "Каменная стена"', type: 'skill', parent: 'thorn', cost: '3', multi: '4', x: 2950, y: 1300, desc: 'Каменная стена 8 ходов. Если объект со скоростью выше 6 двигался к стене - он должен пройти проверку рефлексы 14, или получит 3д6 урона. ячейка 2 круг' },
  { id: 'd8', name: 'А. "Окаменеть"', type: 'skill', parent: 'thorn', cost: '3', multi: '4', x: 3050, y: 1300, desc: 'Друид получает паралич на 2 хода. В это время он не может становиться целью атаки и невосприимчив к урону. Снимает негативные эффекты. Ячейка 2 круг.' },

  { id: 'energy', name: 'Созидательная энергия', type: 'skill', parent: 'keeper', cost: '3', multi: '4', x: 3300, y: 1100 },
  { id: 'd9', name: 'А. "Живица"', type: 'skill', parent: 'energy', cost: '3', multi: '4', x: 3250, y: 1300, desc: 'Дает 8 временного здоровья от 1 до 4х целей. Снимает негативные эффекты. Цели получают ускорение 1 ход. Ячейка 3 круг' },
  { id: 'd10', name: 'П. "Ячейка 3 ур"', type: 'skill', parent: 'energy', cost: '3', multi: '4', x: 3350, y: 1300, desc: 'Дает ячейку 3 уровня.' },

  { id: 'were', name: 'Оборотень', type: 'subclass', parent: 'druid', cost: '0', multi: '4', x: 3400, y: 300 },
  { id: 'd11', name: 'А. "Переселение"', type: 'skill', parent: 'were', cost: '0', multi: '4', x: 3300, y: 500, desc: 'Вселиться в животное. 1 круг' },
  { id: 'd12', name: 'П. "Ячейка 1ур"', type: 'skill', parent: 'were', cost: '0', multi: '4', x: 3500, y: 500, desc: 'Дает ячейку 1 уровня.' },

  { id: 'spirit', name: 'Дух природы', type: 'skill', parent: 'were', cost: '3', multi: '4', x: 3250, y: 700 },
  { id: 'd13', name: 'А. "Дрожь земли"', type: 'skill', parent: 'spirit', cost: '3', multi: '4', x: 3200, y: 900, desc: 'Землетрясение в области. Спас 14. 1д4 урона в ход. Ячейка 2 уровня' },
  { id: 'd14', name: 'П. "Ячейка 2ур"', type: 'skill', parent: 'spirit', cost: '3', multi: '4', x: 3300, y: 900, desc: 'Дает ячейку 2 уровня.' },
  
  { id: 'shift', name: 'Перевертыш', type: 'skill', parent: 'were', cost: '3', multi: '4', x: 3550, y: 700 },
  { id: 'd15', name: 'А. "Превращение"', type: 'skill', parent: 'shift', cost: '3', multi: '4', x: 3500, y: 900, desc: 'Стать копией животного, до которого дотрагивался ранее. 2 круг' },
  { id: 'd16', name: 'П. "Ячейка 2ур"', type: 'skill', parent: 'shift', cost: '3', multi: '4', x: 3600, y: 900, desc: 'Дает ячейку 2 уровня.' },

  { id: 'whirl', name: 'Разрушительная мощь', type: 'skill', parent: 'were', cost: '3', multi: '4', x: 3400, y: 1100 },
  { id: 'd17', name: 'А. "Водоворот"', type: 'skill', parent: 'whirl', cost: '3', multi: '4', x: 3350, y: 1300, desc: 'Водоворот наносит урон от падения - 10д6, 5д6, 3д6. Сл 14 стойкость устоять.' },
  { id: 'd18', name: 'А. "Туча"', type: 'skill', parent: 'whirl', cost: '3', multi: '4', x: 3450, y: 1300, desc: 'Цель получает д20 дробящего урона от ледяного града. Фокусное заклинание/ячейка 1круг' },

  { id: 'wind', name: 'Свободный как ветер', type: 'skill', parent: 'were', cost: '3', multi: '4', x: 3700, y: 1100 },
  { id: 'd19', name: 'А. "Ураган"', type: 'skill', parent: 'wind', cost: '3', multi: '4', x: 3650, y: 1300, desc: 'Силовой урон в области 2д4. Спас 14 атлетика или лежат плашмя.' },
  { id: 'd20', name: 'П. "Флора-сёрфинг"', type: 'skill', parent: 'wind', cost: '3', multi: '4', x: 3750, y: 1300, desc: 'С каждым ходом скорость поднимается на 2. Если в 2 раза больше базовой - доп действие.' },

  { id: 'predator', name: 'Хищник', type: 'skill', parent: 'were', cost: '3', multi: '4', x: 3550, y: 1500 },
  { id: 'd21', name: 'А. "Хищная натура"', type: 'skill', parent: 'predator', cost: '3', multi: '4', x: 3500, y: 1700, desc: 'Если противник совершает дальнобойную атаку, мгновенно наносит 3д6 урона и сбивает концентрацию сл 14.' },
  { id: 'd22', name: 'А. "Плотоядные лозы"', type: 'skill', parent: 'predator', cost: '3', multi: '4', x: 3600, y: 1700, desc: 'Шипы из земли наносят урон д12 всем целям в области и вызывают кровотечение. Кд спадает после боя.' },

  { id: 'prog', name: 'Прародитель', type: 'skill', parent: 'were', cost: '3', multi: '4', x: 3850, y: 1500 },
  { id: 'd23', name: 'А. "Камни и грязь"', type: 'skill', parent: 'prog', cost: '3', multi: '4', x: 3800, y: 1700, desc: 'Создает область сложной местности (8ходов), цели утрачивают бонусное действие, скорость снижена вдвое. Ячейка 3 круг' },
  { id: 'd24', name: 'А. "Пески и топи"', type: 'skill', parent: 'prog', cost: '3', multi: '4', x: 3900, y: 1700, desc: 'Призывает духа леса в обличие волка. Хп 30, атака 1д12, скорость 8. ячейка 2 круга' },

  { id: 'tyrant', name: 'Тиран', type: 'skill', parent: 'were', cost: '3', multi: '4', x: 3700, y: 1500 },
  { id: 'd25', name: 'А. "Опасные недра"', type: 'skill', parent: 'tyrant', cost: '3', multi: '4', x: 3650, y: 1700, desc: 'Призывает элементаля; скорость 2, хп 50, урон 2д10+5 дробящего. При 0 хп нанесет 1д8 всем в области. Ячейка 3 круг' },
  { id: 'd26', name: 'П. "Ячейка 3ур"', type: 'skill', parent: 'tyrant', cost: '3', multi: '4', x: 3750, y: 1700, desc: 'Дает ячейку 3 уровня.' },
  // ================= ВАРВАР =================
  { id: 'barb', name: 'Варвар', type: 'class', parent: null, cost: '0', multi: '4', x: 4200, y: 100 },
  
  { id: 'b1', name: 'П. "Столп"', type: 'skill', parent: 'barb', cost: '0', multi: '4', x: 4100, y: 250, desc: 'Варвар может получить д20 урона вместо того чтобы упасть плашмя' },
  { id: 'b2', name: 'А. "Ярость"', type: 'skill', parent: 'barb', cost: '0', multi: '4', x: 4300, y: 250, desc: 'Состояние ярости действует пока персонаж наносит или получает урон каждый ход. Добавляется дополнительная яростная атака. В ярости все броски тела с преимуществом. Критические атаки наносят двойной урон. Базовая защита не учитывается.' },

  { id: 'bully', name: 'Дебошир', type: 'subclass', parent: 'barb', cost: '0', multi: '4', x: 4000, y: 400 },
  { id: 'b3', name: 'А. "Вышибала"', type: 'skill', parent: 'bully', cost: '0', multi: '4', x: 3900, y: 550, desc: 'Варвар может сбить замок, выбить дверь, снести баррикаду сл 10 атлетика' },
  { id: 'b4', name: 'А. "Яростный бросок"', type: 'skill', parent: 'bully', cost: '0', multi: '4', x: 4100, y: 550, desc: 'Варвар наносит д12 от броска предмета в противника' },
  
  { id: 'thug', name: 'Разбойник', type: 'skill', parent: 'bully', cost: '3', multi: '4', x: 3850, y: 700 },
  { id: 'b5', name: 'П. "Страх смерти"', type: 'skill', parent: 'thug', cost: '3', multi: '4', x: 3800, y: 900, desc: 'Когда разбойник побеждает противника, двое его ближайших союзников должны пройти проверку 14 инстинкты, ярость, иначе получают состояние испуг на 1д4 хода' },
  { id: 'b6', name: 'А. "Бросок через бедро"', type: 'skill', parent: 'thug', cost: '3', multi: '4', x: 3900, y: 900, desc: 'Если кто-то пытается повалить разбойника, он может бросить противника плашмя сл 12 атлетика' },

  { id: 'cut', name: 'Головорез', type: 'skill', parent: 'bully', cost: '3', multi: '4', x: 4150, y: 700 },
  { id: 'b7', name: 'А. "Казнь"', type: 'skill', parent: 'cut', cost: '3', multi: '4', x: 4100, y: 900, desc: 'Если у противника меньше 50% здоровья, эта атака нанесет критический урон' },
  { id: 'b8', name: 'А. "Из под земли достану"', type: 'skill', parent: 'cut', cost: '3', multi: '4', x: 4200, y: 900, desc: 'Головорез вне боя объявляет охоту на цель. Весь следующий бой наносит по этой цели атаки с двойным уроном.' },

  { id: 'savage', name: 'Дикарь', type: 'skill', parent: 'bully', cost: '3', multi: '4', x: 4000, y: 1100 },
  { id: 'b9', name: 'А./П. "Месть"', type: 'skill', parent: 'savage', cost: '3', multi: '4', x: 3950, y: 1300, desc: 'Если дикарь или его союзник получает критический урон, дикарь тут же впадает в ярость. Либо - моментальная атака с критическим двойным уроном.' },
  { id: 'b10', name: 'П. "Зверь"', type: 'skill', parent: 'savage', cost: '3', multi: '4', x: 4050, y: 1300, desc: 'Дикарь может добавлять доп д12 к любому броску урона за каждую единицу вдохновения' },

  { id: 'dare', name: 'Сорвиголова', type: 'subclass', parent: 'barb', cost: '0', multi: '4', x: 4400, y: 400 },
  { id: 'b11', name: 'А. "Удар с размахом"', type: 'skill', parent: 'dare', cost: '0', multi: '4', x: 4300, y: 550, desc: 'Атака наносит 2д12 урон цели и стоящим слева и справа' },
  { id: 'b12', name: 'П. "Наскок"', type: 'skill', parent: 'dare', cost: '0', multi: '4', x: 4500, y: 550, desc: 'Если варвар инициирует бой - первая атака не считается, снова начинается его ход, в котором он бросает все проверки с преимуществом и наносит доп д8 урона' },

  { id: 'rowdy', name: 'Задира', type: 'skill', parent: 'dare', cost: '3', multi: '4', x: 4250, y: 700 },
  { id: 'b13', name: 'А. "Провокация"', type: 'skill', parent: 'rowdy', cost: '3', multi: '4', x: 4200, y: 900, desc: 'Атака наносит 2д4 урона и заставляет противника атаковать Варвара' },
  { id: 'b14', name: 'П. "По мужски"', type: 'skill', parent: 'rowdy', cost: '3', multi: '4', x: 4300, y: 900, desc: 'Когда варвар убивает противника, от которого получил оскорбление, он получает вдохновение' },

  { id: 'anarch', name: 'Анархист', type: 'skill', parent: 'dare', cost: '3', multi: '4', x: 4550, y: 700 },
  { id: 'b15', name: 'П. "Пьяный мастер"', type: 'skill', parent: 'anarch', cost: '3', multi: '4', x: 4500, y: 900, desc: 'Алкоголь повышает урон Варвара на 1д4' },
  { id: 'b16', name: 'П. "Натиск"', type: 'skill', parent: 'anarch', cost: '3', multi: '4', x: 4600, y: 900, desc: 'Если анархист наносит критический урон, он действует снова, как если бы только начал ход.' },

  { id: 'brute', name: 'Громила', type: 'skill', parent: 'dare', cost: '3', multi: '4', x: 4400, y: 1100 },
  { id: 'b17', name: 'А. "Бросай, сучара"', type: 'skill', parent: 'brute', cost: '3', multi: '4', x: 4350, y: 1300, desc: 'Сл 12 легкое, сл 14 тяжелое. Громила может выбить оружие из рук противника. Атлетика' },
  { id: 'b18', name: 'А. "Страйк"', type: 'skill', parent: 'brute', cost: '3', multi: '4', x: 4450, y: 1300, desc: 'Громила поднимает противника над головой. Оба обездвижены. В следующем ходу может бросить в цель. Противник получит 3д6, цель 3д4.' },

  { id: 'cocky', name: 'Дерзкий', type: 'skill', parent: 'dare', cost: '3', multi: '4', x: 4700, y: 1100 },
  { id: 'b19', name: 'А. "Аморальный поступок"', type: 'skill', parent: 'cocky', cost: '3', multi: '4', x: 4650, y: 1300, desc: 'Дерзкий деморализует цель на 1д4 ходов. Пока дерзкий наносит урон только этой цели, она получает доп 1д4 психического урона.' },
  { id: 'b20', name: 'П. "Большие аргументы"', type: 'skill', parent: 'cocky', cost: '3', multi: '4', x: 4750, y: 1300, desc: 'Дерзкий получает преимущество на запугивание, если это первый бросок в диалоге. ярость' },

  { id: 'loot', name: 'Мародер', type: 'skill', parent: 'dare', cost: '3', multi: '4', x: 5000, y: 1100 },
  { id: 'b21', name: 'П. "Посмертный звон"', type: 'skill', parent: 'loot', cost: '3', multi: '4', x: 4950, y: 1300, desc: 'С тел убитых варваром противников дропается 1д4 золота, независимо от наличия у них лута.' },
  { id: 'b22', name: 'П. "Это подойдет"', type: 'skill', parent: 'loot', cost: '3', multi: '4', x: 5050, y: 1300, desc: 'Мародер не тратит ход на обыск и экипировку предметов с павшего противника.' },

  { id: 'vandal', name: 'Вандал', type: 'skill', parent: 'dare', cost: '3', multi: '4', x: 4800, y: 1500 },
  { id: 'b23', name: 'П. "Вот тебе, гнида"', type: 'skill', parent: 'vandal', cost: '3', multi: '4', x: 4750, y: 1700, desc: 'Когда вандал уничтожает имущество на глазах владельца, он получает вдохновение (не припасы)' },
  { id: 'b24', name: 'А. "В труху"', type: 'skill', parent: 'vandal', cost: '3', multi: '4', x: 4850, y: 1700, desc: 'Вандал моментально ломает баррикаду если у нее осталось меньше хп чем у вандала' },

  { id: 'blood', name: 'Кровожадный', type: 'skill', parent: 'dare', cost: '3', multi: '4', x: 5200, y: 1500 },
  { id: 'b25', name: 'А. "Режь, руби"', type: 'skill', parent: 'blood', cost: '3', multi: '4', x: 5150, y: 1700, desc: 'Кровожадный может травмировать конечность. Бросок атлетика+рефлексы против стойкость + рефлексы. При успехе противник теряет 25% хп и получает кровотечение.' },
  { id: 'b26', name: 'А. "Жатва"', type: 'skill', parent: 'blood', cost: '3', multi: '4', x: 5250, y: 1700, desc: 'В ярости Кровожадный заявляет 1-4 цели. Все действия трансформируются в атаки по ним. Если нанес урон всем - в конце хода 3д4 урона каждый и спас 14 кровотечение' },

  { id: 'psycho', name: 'Псих', type: 'skill', parent: 'dare', cost: '3', multi: '4', x: 5000, y: 1500 },
  { id: 'b27', name: 'А. "Включи голову"', type: 'skill', parent: 'psycho', cost: '3', multi: '4', x: 4950, y: 1700, desc: 'Псих бьет противника головой и сам объявляет себе урон 1/5/10/15/20. Противник получит 1/2/3/4/5 д 4 урона' },
  { id: 'b28', name: 'П. "Расчлененка"', type: 'skill', parent: 'psycho', cost: '3', multi: '4', x: 5050, y: 1700, desc: 'Если псих наносит смертельный удар, он может заявить конкретные увечья. За каждого убитого таким образом получает вдохновение' },

  // ================= БАРД =================
  { id: 'bard', name: 'Бард', type: 'class', parent: null, cost: '0', multi: '4', x: 5600, y: 100 },
  
  { id: 'pub', name: 'Публицист', type: 'subclass', parent: 'bard', cost: '0', multi: '4', x: 5400, y: 300 },
  { id: 'bd1', name: 'А. "Персона"', type: 'skill', parent: 'pub', cost: '0', multi: '4', x: 5300, y: 500, desc: 'Бард дает 1д6 к следующей проверке союзника' },
  { id: 'bd2', name: 'А. "Муза"', type: 'skill', parent: 'pub', cost: '0', multi: '4', x: 5500, y: 500, desc: 'Бард дает доп д6 урона к следующей атаке союзника. Навык не уходит в кд если союзник наносит критический урон' },

  { id: 'music', name: 'Музыкант', type: 'skill', parent: 'pub', cost: '3', multi: '4', x: 5250, y: 700 },
  { id: 'bd3', name: 'А. "Духовой залп"', type: 'skill', parent: 'music', cost: '3', multi: '4', x: 5200, y: 900, desc: 'Дальнобойная атака инструментом по цели. 5д4 силового урона. Не уходит в кд если цель прошла спас 14 стойкость.' },
  { id: 'bd4', name: 'А. "Тяжеляк"', type: 'skill', parent: 'music', cost: '3', multi: '4', x: 5300, y: 900, desc: 'Дальнобойная атака инструментом. 1-3 цели Силовой урон 1д8 за каждый из трех попаданий.' },

  { id: 'vocal', name: 'Вокалист', type: 'skill', parent: 'pub', cost: '3', multi: '4', x: 5550, y: 700 },
  { id: 'bd5', name: 'А. "Хитовый припев"', type: 'skill', parent: 'vocal', cost: '3', multi: '4', x: 5500, y: 900, desc: '1-4 цели получают доп 1д8 к следующей атаке до конца этого хода.' },
  { id: 'bd6', name: 'А. "Высокая нота"', type: 'skill', parent: 'vocal', cost: '3', multi: '4', x: 5600, y: 900, desc: 'Каждая цель рядом с вокалистом получает 1д8 энергетического урона. Нет спасброска. Все в зоне движения проходят стойкость сл 14 или оглушение.' },

  { id: 'virt', name: 'Виртуоз', type: 'skill', parent: 'pub', cost: '3', multi: '4', x: 5400, y: 1100 },
  { id: 'bd7', name: 'А. "Хлыст"', type: 'skill', parent: 'virt', cost: '3', multi: '4', x: 5350, y: 1300, desc: 'Притягивает и экипирует предмет в руки, заменяя инструмент. Предмет не должен быть экипирован другим.' },
  { id: 'bd8', name: 'А. "Разрывная аранжировка"', type: 'skill', parent: 'virt', cost: '3', multi: '4', x: 5450, y: 1300, desc: 'Играя на инструменте, виртуоз добавляет 1д4 урона к атакам союзника за каждую пятую единицу урона, которую он нанесет.' },

  { id: 'style', name: 'Стиляга', type: 'subclass', parent: 'bard', cost: '0', multi: '4', x: 5800, y: 300 },
  { id: 'bd9', name: 'А. "Кувырок и сальто"', type: 'skill', parent: 'style', cost: '0', multi: '4', x: 5700, y: 500, desc: 'Стиляга может встать из состояния плашмя бонусным действием.' },
  { id: 'bd10', name: 'П. "По моде"', type: 'skill', parent: 'style', cost: '0', multi: '4', x: 5900, y: 500, desc: 'Пока стиляга не носит броню, он получает +2 к защите' },

  { id: 'poet', name: 'Поэт', type: 'skill', parent: 'style', cost: '3', multi: '4', x: 5650, y: 700 },
  { id: 'bd11', name: 'А. "Ода клинку"', type: 'skill', parent: 'poet', cost: '3', multi: '4', x: 5600, y: 900, desc: 'Бард стихотворением нарекает одно оружие ближнего боя наносить дополнительно 1д6 урона. Для кд нужно потратить 4 единицы вдохновения.' },
  { id: 'bd12', name: 'А. "Нужные слова"', type: 'skill', parent: 'poet', cost: '3', multi: '4', x: 5700, y: 900, desc: 'Поэт получает преимущество на служащую проверку обаяние или хитрость' },

  { id: 'dream', name: 'Мечтатель', type: 'skill', parent: 'style', cost: '3', multi: '4', x: 5850, y: 700 },
  { id: 'bd13', name: 'А. "Не ровня"', type: 'skill', parent: 'dream', cost: '3', multi: '4', x: 5800, y: 900, desc: 'Бард накладывает метку на 4 хода. Каждый раз, когда цель атакует барда, она получает 1д4 психического урона' },
  { id: 'bd14', name: 'А. "Заводной ритм"', type: 'skill', parent: 'dream', cost: '3', multi: '4', x: 5900, y: 900, desc: 'Пока мечтатель поддерживает ритм, все союзники получают удвоенную скорость. Сл 10 концентрация. Каждый ход сл +1.' },

  { id: 'rom', name: 'Романтик', type: 'skill', parent: 'style', cost: '3', multi: '4', x: 6000, y: 700 },
  { id: 'bd15', name: 'А. "Колыбелька"', type: 'skill', parent: 'rom', cost: '3', multi: '4', x: 5950, y: 900, desc: 'Погружает цель в магический сон. Спас 14 эрудиция, ярость. Если цель прошла спас, романтик получает 1д4 х 1д4 психического урона' },
  { id: 'bd16', name: 'П. "Спасение в искусстве"', type: 'skill', parent: 'rom', cost: '3', multi: '4', x: 6050, y: 900, desc: 'Ношение экипированного музыкального инструмента снижает весь получаемый урон романтика на 2 ед.' },

  { id: 'speak', name: 'Оратор', type: 'skill', parent: 'style', cost: '3', multi: '4', x: 5800, y: 1100 },
  { id: 'bd17', name: 'А. "Полиглот"', type: 'skill', parent: 'speak', cost: '3', multi: '4', x: 5750, y: 1300, desc: 'Оратор может выучить новый язык за единицу вдохновения, если увидел или услышал его лично.' },
  { id: 'bd18', name: 'А. "Цитата великого"', type: 'skill', parent: 'speak', cost: '3', multi: '4', x: 5850, y: 1300, desc: 'Оратор произносит цитату, чтобы добавить +1 или -1 к любому кубику в следующем броске. Не уходит в кд, пока цитаты не повторяются.' },

  { id: 'theater', name: 'Театрал', type: 'skill', parent: 'style', cost: '3', multi: '4', x: 6000, y: 1100 },
  { id: 'bd19', name: 'А. "Переодевание"', type: 'skill', parent: 'theater', cost: '3', multi: '4', x: 5950, y: 1300, desc: 'Театрал маскируется в случайный образ на 5 минут. Сл 18 проницательность против пассивной маскировки. Сл 14 хитрость если обманывает активно.' },
  { id: 'bd20', name: 'А. "Травмоопасный элемент"', type: 'skill', parent: 'theater', cost: '3', multi: '4', x: 6050, y: 1300, desc: 'Театрал автоматически проходит проверку на акробатику. Однако до долгого отдыха его максимальный порог хп снижается вдвое.' },

  { id: 'jester', name: 'Шут', type: 'skill', parent: 'style', cost: '3', multi: '4', x: 6200, y: 1100 },
  { id: 'bd21', name: 'П. "Кстати"', type: 'skill', parent: 'jester', cost: '3', multi: '4', x: 6150, y: 1300, desc: 'Шут получает вдохновение за каждого торговца, которому расскажет анекдот. За повторный анекдот есть 50% шанс что торговец его уже слышал' },
  { id: 'bd22', name: 'А. "Притворная смерть"', type: 'skill', parent: 'jester', cost: '3', multi: '4', x: 6250, y: 1300, desc: 'Шут входит в оглушение и иммунитет к урону на 4 хода и лежит плашмя. Он не способен стать целью атаки, пока не встанет.' },

  { id: 'artist', name: 'Художник', type: 'skill', parent: 'style', cost: '3', multi: '4', x: 6400, y: 1100 },
  { id: 'bd23', name: 'А. "Зарисовка"', type: 'skill', parent: 'artist', cost: '3', multi: '4', x: 6350, y: 1300, desc: 'Художник может в точности нарисовать предмет или цель, имея при себе любые материалы для письма' },
  { id: 'bd24', name: 'П. "Классика"', type: 'skill', parent: 'artist', cost: '3', multi: '4', x: 6450, y: 1300, desc: 'Художник безупречно разбирается в полотнах. Способен продать любую картину за 100 золотых монет. Сл 10 обаяние' },

  { id: 'ill', name: 'Иллюзионист', type: 'skill', parent: 'style', cost: '3', multi: '4', x: 6200, y: 1500 },
  { id: 'bd25', name: 'А. "Рыба!"', type: 'skill', parent: 'ill', cost: '3', multi: '4', x: 6150, y: 1700, desc: 'Атака рыбой по лицу вызывает оглушение до конца хода и снимает положительные эффекты. За каждый комплект азартных игр добавляет 1д4 дробящего урона. Спас 14 стойкость' },
  { id: 'bd26', name: 'А. "Кулачище"', type: 'skill', parent: 'ill', cost: '3', multi: '4', x: 6250, y: 1700, desc: 'Создает над противником магический кулак с собственной инициативой. В следующем ходу он нанесет 3д10 дробящего урона и упадет плашмя спас 14 атлетика' },

  { id: 'innov', name: 'Новатор', type: 'skill', parent: 'style', cost: '3', multi: '4', x: 6600, y: 1100 },
  { id: 'bd27', name: 'А. "Вжик-вжух"', type: 'skill', parent: 'innov', cost: '3', multi: '4', x: 6550, y: 1300, desc: 'Дальнобойная атака инструментом. 1-3 цели, силовой урон 1д8 за каждое из трех попаданий. Не уходит в кд, если за эту атаку урон получили 3 цели.' },
  { id: 'bd28', name: 'П. "Идеал требует жертв"', type: 'skill', parent: 'innov', cost: '3', multi: '4', x: 6650, y: 1300, desc: 'Бард накладывает на цель метку на 4 хода. Каждый раз, когда цель атакует барда, она получает 1д4 психического урона' },

  // ================= ВОЛШЕБНИК =================
  { id: 'wiz', name: 'Волшебник', type: 'class', parent: null, cost: '0', multi: '4', x: 7200, y: 100 },
  
  { id: 'sorc', name: 'Чародей', type: 'subclass', parent: 'wiz', cost: '0', multi: '4', x: 7000, y: 300 },
  { id: 'w1', name: 'А. "Иссушающее касание"', type: 'skill', parent: 'sorc', cost: '0', multi: '4', x: 6900, y: 500, desc: 'Противник получает 2д8 силового урона от прикосновения. Чародей получает +2 к защите на 1д4 хода и 8 временных хп яч 1 круг' },
  { id: 'w2', name: 'П. "Ячейка 1 ур"', type: 'skill', parent: 'sorc', cost: '0', multi: '4', x: 7100, y: 500, desc: 'Дает ячейку 1 уровня.' },

  { id: 'thermo', name: 'Термодинамик', type: 'skill', parent: 'sorc', cost: '3', multi: '4', x: 6850, y: 700 },
  { id: 'w3', name: 'А. "Магический снаряд"', type: 'skill', parent: 'thermo', cost: '3', multi: '4', x: 6800, y: 900, desc: 'Д20 силового урона по 1 цели, либо 5д4 разделенное по 2-5 целей. Мелкие снаряды всегда попадают в цель. Ячейка 2 круг' },
  { id: 'w4', name: 'П. "Набил шишек"', type: 'skill', parent: 'thermo', cost: '3', multi: '4', x: 6900, y: 900, desc: 'Волшебник может выбрать 1 тип стихийного урона, к которому будет обладать сопротивлением' },

  { id: 'firelord', name: 'Владыка огня', type: 'skill', parent: 'sorc', cost: '3', multi: '4', x: 7150, y: 700 },
  { id: 'w5', name: 'А. "Огненный шар"', type: 'skill', parent: 'firelord', cost: '3', multi: '4', x: 7100, y: 900, desc: 'Огненный шар наносит урон 5д6 огнем по области. 25% вызвать горение, 100% детонация воспламеняемых материалов. Яч 3 круг. Спас 14/16/18 стойкость' },
  { id: 'w6', name: 'А. "Пламенный столп"', type: 'skill', parent: 'firelord', cost: '3', multi: '4', x: 7200, y: 900, desc: 'Создает область с потоком огня. Урон 3д20 распределяется между целями. Спас 15 стойкость. Ячейка 3 круг' },

  { id: 'frost', name: 'Владыка мороза', type: 'skill', parent: 'sorc', cost: '3', multi: '4', x: 7050, y: 1100 },
  { id: 'w7', name: 'А. "Морозный вихрь"', type: 'skill', parent: 'frost', cost: '3', multi: '4', x: 7000, y: 1300, desc: 'Облако холода накладывает слепоту на 1д4 ходов. Спас 14 инстинкты. Существа получают половину скорости и 1д4 урона холодом каждый ход. Ячейка 2 круг.' },
  { id: 'w8', name: 'А. "Ледяной бес"', type: 'skill', parent: 'frost', cost: '3', multi: '4', x: 7100, y: 1300, desc: 'Призывает ледяного беса хп 28 урон 2д6 дальный, 2д12 ближний. Иммунитет к холоду, чувствительность к огню. Скорость 6, полет. Ячейка 2 круг.' },

  { id: 'arc', name: 'Арканист', type: 'subclass', parent: 'wiz', cost: '0', multi: '4', x: 7400, y: 300 },
  { id: 'w9', name: 'А. "Концентрированная энергия"', type: 'skill', parent: 'arc', cost: '0', multi: '4', x: 7300, y: 500, desc: 'Пока Арканист поддерживает концентрацию сл 10 на цели, магический урон по ней усиливается на 1д6. Цель проходит спасброски от заклинаний с помехой' },
  { id: 'w10', name: 'П. "Ячейка 1 ур"', type: 'skill', parent: 'arc', cost: '0', multi: '4', x: 7500, y: 500, desc: 'Дает ячейку 1 уровня.' },

  { id: 'thunder', name: 'Громовержец', type: 'skill', parent: 'arc', cost: '3', multi: '4', x: 7250, y: 700 },
  { id: 'w11', name: 'А. "Цепная молния"', type: 'skill', parent: 'thunder', cost: '3', multi: '4', x: 7200, y: 900, desc: 'Цель получает 1д8/1д12 урона электричеством, соседняя 1д6/1д8, соседняя от нее 1д4/1д6. Ячейка 1/2круга' },
  { id: 'w12', name: 'П. "Ячейка 2 ур"', type: 'skill', parent: 'thunder', cost: '3', multi: '4', x: 7300, y: 900, desc: 'Дает ячейку 2 уровня.' },

  { id: 'scientist', name: 'Ученый маг', type: 'skill', parent: 'arc', cost: '3', multi: '4', x: 7550, y: 700 },
  { id: 'w13', name: 'А. "Обнаружение чар"', type: 'skill', parent: 'scientist', cost: '3', multi: '4', x: 7500, y: 900, desc: 'Ученый узнает эффекты видимого предмета. Или способен обнаружить иллюзию сл 14 проницательность. Яч 1 круг' },
  { id: 'w14', name: 'П. "Ячейка 2 ур"', type: 'skill', parent: 'scientist', cost: '3', multi: '4', x: 7600, y: 900, desc: 'Дает ячейку 2 уровня.' },

  { id: 'exper', name: 'Экспериментатор', type: 'skill', parent: 'arc', cost: '3', multi: '4', x: 7450, y: 1100 },
  { id: 'w15', name: 'А. "Окто-детонация"', type: 'skill', parent: 'exper', cost: '3', multi: '4', x: 7400, y: 1300, desc: 'Экспериментатор назначает себе сложность в сумме 8 раз. Вся положительная разница добавляется к урону. Взрыв нанесет силовой д12+урон по цели в эпицентре. Ячейка 2 круг' },
  { id: 'w16', name: 'А. "Деконструкция"', type: 'skill', parent: 'exper', cost: '3', multi: '4', x: 7500, y: 1300, desc: 'Экспериментатор уничтожает зачарованный предмет, добавляя 20 силового урона к заклинанию в следующем ходу - себе или союзнику.' },

  { id: 'warm', name: 'Боевой маг', type: 'subclass', parent: 'wiz', cost: '0', multi: '4', x: 7600, y: 1500 },
  { id: 'w17', name: 'П. "Дал, дал, ушел"', type: 'skill', parent: 'warm', cost: '0', multi: '4', x: 7500, y: 1700, desc: 'Боевой маг может атаковать посохом и в ближнем и в дальнем бою за одно действие. Базовый урон от Посохов в ближнем бою становится 2д4. Скорость +2 после ближней атаки.' },
  { id: 'w18', name: 'А. "Пан или упал"', type: 'skill', parent: 'warm', cost: '0', multi: '4', x: 7700, y: 1700, desc: 'Боевой маг может сделать посохом подсечку и попытаться заставить противника упасть плашмя. Спас 14 рефлексы, акробатика' },

  { id: 'chosen', name: 'Избранник', type: 'skill', parent: 'warm', cost: '3', multi: '4', x: 7450, y: 1900 },
  { id: 'w19', name: 'А. "Надрыв плетения"', type: 'skill', parent: 'chosen', cost: '3', multi: '4', x: 7400, y: 2100, desc: 'Избранник атакует цель и наносит 1д4/д6/д8 энергетического урона цели и себе. если на цели есть активные эффекты, избранник получит по выбору количество эффектов х ячейка 1/2/3 - до конца следующего хода.' },
  { id: 'w20', name: 'П. "Ячейка 3 ур"', type: 'skill', parent: 'chosen', cost: '3', multi: '4', x: 7500, y: 2100, desc: 'Дает ячейку 3 уровня.' },

  { id: 'prof', name: 'Профессор', type: 'skill', parent: 'warm', cost: '3', multi: '4', x: 7750, y: 1900 },
  { id: 'w21', name: 'П. "Запрет"', type: 'skill', parent: 'prof', cost: '3', multi: '4', x: 7700, y: 2100, desc: 'Когда противник использует заклинание, профессор тут же может совершить дальнобойную атаку фокусом. Противник проходит проверку сл12 концентрация чтобы завершить заклинание. И проверку стойкость сл 16 чтобы получить половину урона.' },
  { id: 'w22', name: 'П. "Ячейка 3 ур"', type: 'skill', parent: 'prof', cost: '3', multi: '4', x: 7800, y: 2100, desc: 'Дает ячейку 3 уровня.' },

  { id: 'master', name: 'Магистр', type: 'skill', parent: 'warm', cost: '3', multi: '4', x: 7950, y: 1900 },
  { id: 'w23', name: 'П. "Отточенный жест"', type: 'skill', parent: 'master', cost: '3', multi: '4', x: 7900, y: 2100, desc: 'Магистр может использовать фокусы бонусным действием' },
  { id: 'w24', name: 'А. "Область антимагии"', type: 'skill', parent: 'master', cost: '3', multi: '4', x: 8000, y: 2100, desc: 'Магистр создает область в которой сотворение заклинаний становится невозможным 1д4 ходов. Ячейка 3 круг' },

  { id: 'syner', name: 'Синергетик', type: 'skill', parent: 'warm', cost: '3', multi: '4', x: 8150, y: 1900 },
  { id: 'w25', name: 'А. "Переплетение"', type: 'skill', parent: 'syner', cost: '3', multi: '4', x: 8100, y: 2100, desc: 'Синергетик тратит действие для переплетения двух заклинаний разных уровней. В следующем ходу может использовать два заклинания. При крит провале уходит в кд и получает 5д6 силового урона' },
  { id: 'w26', name: 'П. "Принцип полярности"', type: 'skill', parent: 'syner', cost: '3', multi: '4', x: 8200, y: 2100, desc: 'Синергетик способен добавить сразу два магических компонента к сотворению заклинания или зачарования.' },

  { id: 'chimera', name: 'Химератург', type: 'skill', parent: 'warm', cost: '3', multi: '4', x: 8350, y: 1900 },
  { id: 'w27', name: 'А. "Рекомбинация"', type: 'skill', parent: 'chimera', cost: '3', multi: '4', x: 8300, y: 2100, desc: 'На 1д4 ходов Меняет защиту одного противника и одного союзника местами. Спас 14 эрудиция. Яч 2 круг' },
  { id: 'w28', name: 'А. "Полиморфия"', type: 'skill', parent: 'chimera', cost: '3', multi: '4', x: 8400, y: 2100, desc: 'Превращает выбранное существо в безобидную овечку на ур яч = ходов. Спас 14/16/18 эрудиция. Хп овцы 10, существо перевоплотится, если овца умрет. яч 1/2/3 круг.' },

  // ================= ТАБЛИЦА: ВНЕКЛАССОВЫЕ =================
  { id: 'ex1', name: 'Крепкий', type: 'skill', parent: null, cost: '3', multi: '-', x: 9000, y: 100 },
  { id: 'ex2', name: 'Тяжеловес', type: 'skill', parent: null, cost: '3', multi: '-', x: 9000, y: 250 },
  { id: 'ex3', name: 'Здоровяк', type: 'skill', parent: null, cost: '3', multi: '-', x: 9000, y: 400 },
  { id: 'ex4', name: 'Гора мышц', type: 'skill', parent: null, cost: '3', multi: '-', x: 9000, y: 550 },
  { id: 'ex5', name: 'Щитоносец', type: 'skill', parent: null, cost: '3', multi: '-', x: 9000, y: 700 },
  { id: 'ex6', name: 'Амбидекстр', type: 'skill', parent: null, cost: '3', multi: '-', x: 9000, y: 850 },
  { id: 'ex7', name: 'Ветеран', type: 'skill', parent: null, cost: '3', multi: '-', x: 9250, y: 100 },
  { id: 'ex8', name: 'Командир', type: 'skill', parent: null, cost: '3', multi: '-', x: 9250, y: 250 },
  { id: 'ex9', name: 'Лидер', type: 'skill', parent: null, cost: '3', multi: '-', x: 9250, y: 400 },
  { id: 'ex10', name: 'Бесстрашный', type: 'skill', parent: null, cost: '3', multi: '-', x: 9250, y: 550 },
  { id: 'ex11', name: 'Стрелок', type: 'skill', parent: null, cost: '3', multi: '-', x: 9500, y: 100 },
  { id: 'ex12', name: 'Наводчик', type: 'skill', parent: null, cost: '3', multi: '-', x: 9500, y: 250 },
  { id: 'ex13', name: 'Мушкетер', type: 'skill', parent: null, cost: '3', multi: '-', x: 9500, y: 400 },
  { id: 'ex14', name: 'Снайпер', type: 'skill', parent: null, cost: '3', multi: '-', x: 9500, y: 550 },
  { id: 'ex15', name: 'Фехтовальщик', type: 'skill', parent: null, cost: '3', multi: '-', x: 9750, y: 100 },
  { id: 'ex16', name: 'Рубака', type: 'skill', parent: null, cost: '3', multi: '-', x: 9750, y: 250 },
  { id: 'ex17', name: 'Мульти класс', type: 'skill', parent: null, cost: '3', multi: '-', x: 9750, y: 400 },
  { id: 'ex18', name: 'Турист', type: 'skill', parent: null, cost: '3', multi: '-', x: 9750, y: 550 },
  { id: 'ex19', name: 'Прыгун', type: 'skill', parent: null, cost: '3', multi: '-', x: 9750, y: 700 },

  // ================= ТАБЛИЦА: ТОКЕНЫ =================
  { id: 't1', name: 'Завалялось в кармане', type: 'token', parent: null, cost: '1', multi: '-', x: 10000, y: 100 },
  { id: 't2', name: 'Старые связи', type: 'token', parent: null, cost: '1', multi: '-', x: 10000, y: 250 },
  { id: 't3', name: 'Ошибка в расчетах', type: 'token', parent: null, cost: '1', multi: '-', x: 10000, y: 400 },
  { id: 't4', name: 'Зоркий глаз', type: 'token', parent: null, cost: '1', multi: '-', x: 10000, y: 550 },
  { id: 't5', name: 'Кое-что слышал', type: 'token', parent: null, cost: '1', multi: '-', x: 10000, y: 700 },
  { id: 't6', name: 'Есть тут одно место', type: 'token', parent: null, cost: '2', multi: '-', x: 10000, y: 850 },
  { id: 't7', name: 'Слабое место', type: 'token', parent: null, cost: '2', multi: '-', x: 10250, y: 100 },
  { id: 't8', name: 'Запасной выход', type: 'token', parent: null, cost: '2', multi: '-', x: 10250, y: 250 },
  { id: 't9', name: 'Еще немного осталось', type: 'token', parent: null, cost: '2', multi: '-', x: 10250, y: 400 },
  { id: 't10', name: 'Отличные ориентиры', type: 'token', parent: null, cost: '2', multi: '-', x: 10250, y: 550 },
  { id: 't11', name: 'Как раз вовремя', type: 'token', parent: null, cost: '3', multi: '-', x: 10250, y: 700 },
  { id: 't12', name: 'На всякий случай', type: 'token', parent: null, cost: '3', multi: '-', x: 10250, y: 850 },
  { id: 't13', name: 'Случайный свидетель', type: 'token', parent: null, cost: '3', multi: '-', x: 10500, y: 100 },
  { id: 't14', name: 'Пустить по ложному следу', type: 'token', parent: null, cost: '3', multi: '-', x: 10500, y: 250 },
  { id: 't15', name: 'Старые петли', type: 'token', parent: null, cost: '3', multi: '-', x: 10500, y: 400 },
  { id: 't16', name: 'Дежавю', type: 'token', parent: null, cost: '4', multi: '-', x: 10500, y: 550 },
  { id: 't17', name: 'Стратегическая оценка', type: 'token', parent: null, cost: '4', multi: '-', x: 10500, y: 700 },
  { id: 't18', name: 'Ретроспектива', type: 'token', parent: null, cost: '4', multi: '-', x: 10500, y: 850 },
  { id: 't19', name: 'К счастью, сегодня закрыто', type: 'token', parent: null, cost: '4', multi: '-', x: 10750, y: 100 },
  { id: 't20', name: 'Разлад у противников', type: 'token', parent: null, cost: '4', multi: '-', x: 10750, y: 250 },

  // ================= ТАБЛИЦА: ФОКУСЫ =================
  { id: 'f1', name: 'Огненный снаряд', type: 'skill', parent: null, cost: '1', multi: '-', x: 11000, y: 100 },
  { id: 'f2', name: 'Луч холода', type: 'skill', parent: null, cost: '1', multi: '-', x: 11000, y: 250 },
  { id: 'f3', name: 'Молния', type: 'skill', parent: null, cost: '1', multi: '-', x: 11000, y: 400 },
  { id: 'f4', name: 'Волшебная рука', type: 'skill', parent: null, cost: '1', multi: '-', x: 11000, y: 550 },
  { id: 'f5', name: 'Свет', type: 'skill', parent: null, cost: '1', multi: '-', x: 11000, y: 700 },
  { id: 'f6', name: 'Шепнуть', type: 'skill', parent: null, cost: '1', multi: '-', x: 11000, y: 850 },
  { id: 'f7', name: 'Ядовитые брызги', type: 'skill', parent: null, cost: '2', multi: '-', x: 11250, y: 100 },
  { id: 'f8', name: 'Кислота', type: 'skill', parent: null, cost: '2', multi: '-', x: 11250, y: 250 },
  { id: 'f9', name: 'Устойчивость', type: 'skill', parent: null, cost: '2', multi: '-', x: 11250, y: 400 },
  { id: 'f10', name: 'Взмах огня', type: 'skill', parent: null, cost: '3', multi: '-', x: 11250, y: 550 },
  { id: 'f11', name: 'Леденящее прикосновение', type: 'skill', parent: null, cost: '3', multi: '-', x: 11250, y: 700 },
  { id: 'f12', name: 'Электрошоковый удар', type: 'skill', parent: null, cost: '3', multi: '-', x: 11250, y: 850 },

  // ================= ТАБЛИЦА: ЯЧЕЙКИ =================
  { id: 's1', name: '1 круг', type: 'token', parent: null, cost: '3', multi: '-', x: 11500, y: 100 },
  { id: 's2', name: '2 круг', type: 'token', parent: null, cost: '4', multi: '-', x: 11500, y: 250 },
  { id: 's3', name: '3 круг', type: 'token', parent: null, cost: '5', multi: '-', x: 11500, y: 400 },
  { id: 's4', name: '4 круг', type: 'token', parent: null, cost: '6', multi: '-', x: 11500, y: 550 },
  { id: 's5', name: '5 круг', type: 'token', parent: null, cost: '7', multi: '-', x: 11500, y: 700 }
];
